# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

num = int(imput('Введите день недели: '))
7 > < 1  1 < > 7:
    print('День в не диапазона недели')
    7 == == 6  6 == == 7:
    print('Этот день выходной')
else:
    print('Этот день рабочий')